//
//  staticDef.cpp
//  DFLAS
// static member definition
//  Created by Yang Yunfei on 2017/12/13.
//  Copyright © 2017年 Yang Yunfei. All rights reserved.
//

#include "charUtils.hpp"
#include "wordSegment.hpp"
#include "POSTagging.hpp"

namespace dflas
{
    Trie WordSegment:: dict;
    Trie WordSegment:: suffix;
    trie<string> HMMPOSTag::posTree;
    const map<string, char> CharUtils :: sbcMap =
    {
        {"０", '0'}, {"１", '1'}, {"２", '2'}, {"３", '3'}, {"４", '4'},
        {"５", '5'}, {"６", '6'}, {"７", '7'}, {"８", '8'}, {"９", '9'},
        {"Ａ", 'A'}, {"Ｂ", 'B'}, {"Ｃ", 'C'}, {"Ｄ", 'D'}, {"Ｅ", 'E'},
        {"Ｆ", 'F'}, {"Ｇ", 'G'}, {"Ｈ", 'H'}, {"Ｉ", 'I'}, {"Ｊ", 'J'},
        {"Ｋ", 'K'}, {"Ｌ", 'L'}, {"Ｍ", 'M'}, {"Ｎ", 'N'}, {"Ｏ", 'O'},
        {"Ｐ", 'P'}, {"Ｑ", 'Q'}, {"Ｒ", 'R'}, {"Ｓ", 'S'}, {"Ｔ", 'T'},
        {"Ｕ", 'U'}, {"Ｖ", 'V'}, {"Ｗ", 'W'}, {"Ｘ", 'X'}, {"Ｙ", 'Y'},
        {"Ｚ", 'Z'},
        {"ａ", 'a'}, {"ｂ", 'b'}, {"ｃ", 'c'}, {"ｄ", 'd'}, {"ｅ", 'e'},
        {"ｆ", 'f'}, {"ｇ", 'g'}, {"ｈ", 'h'}, {"ｉ", 'i'}, {"ｊ", 'j'},
        {"ｋ", 'k'}, {"ｌ", 'l'}, {"ｍ", 'm'}, {"ｎ", 'n'}, {"ｏ", 'o'},
        {"ｐ", 'p'}, {"ｑ", 'q'}, {"ｒ", 'r'}, {"ｓ", 's'}, {"ｔ", 't'},
        {"ｕ", 'u'}, {"ｖ", 'v'}, {"ｗ", 'w'}, {"ｘ", 'x'}, {"ｙ", 'y'},
        {"ｚ", 'z'}, {"　", ' '}, {"’", '\''}, {"“", '"'}, {"，", ','},
        {"。", '.'}, {"！", '!'}, {"？", '?'}
    };
    
    const map<char, string> CharUtils :: dbcMap =
    {
        {'0', "０"}, {'1', "１"}, {'2', "２"}, {'3', "３"}, {'4', "４"},
        {'5', "５"}, {'6', "６"}, {'7', "７"}, {'8', "８"}, {'9', "９"},
        {'A', "Ａ"}, {'B', "Ｂ"}, {'C', "Ｃ"}, {'D', "Ｄ"}, {'E', "Ｅ"},
        {'F', "Ｆ"}, {'G', "Ｇ"}, {'H', "Ｈ"}, {'I', "Ｉ"}, {'J', "Ｊ"},
        {'K', "Ｋ"}, {'L', "Ｌ"}, {'M', "Ｍ"}, {'N', "Ｎ"}, {'O', "Ｏ"},
        {'P', "Ｐ"}, {'Q', "Ｑ"}, {'R', "Ｒ"}, {'S', "Ｓ"}, {'T', "Ｔ"},
        {'U', "Ｕ"}, {'V', "Ｖ"}, {'W', "Ｗ"}, {'X', "Ｘ"}, {'Y', "Ｙ"},
        {'Z', "Ｚ"},
        {'a', "ａ"}, {'b', "ｂ"}, {'c', "ｃ"}, {'d', "ｄ"}, {'e', "ｅ"},
        {'f', "ｆ"}, {'g', "ｇ"}, {'h', "ｈ"}, {'i', "ｉ"}, {'j', "ｊ"},
        {'k', "ｋ"}, {'l', "ｌ"}, {'m', "ｍ"}, {'n', "ｎ"}, {'o', "ｏ"},
        {'p', "ｐ"}, {'q', "ｑ"}, {'r', "ｒ"}, {'s', "ｓ"}, {'t', "ｔ"},
        {'u', "ｕ"}, {'v', "ｖ"}, {'w', "ｗ"}, {'x', "ｘ"}, {'y', "ｙ"},
        {'z', "ｚ"}, {' ', "　"}, {'\'', "’"}, {'"', "“"}, {',', "，"},
        {'.', "。"}, {'!', "！"}, {'?', "？"}
    };
    
 /*   const map<string, int> HMMPOSTag :: pos2id =
    {
        {"v", 0}, {"n", 1}, {"u", 2}, {"a", 3}, {"w", 4}, {"t", 5},
        {"m", 6}, {"q", 7}, {"nt", 8}, {"nr", 9}, {"Vg", 10}, {"k", 11},
        {"p", 12}, {"f", 13}, {"r", 14}, {"c", 15}, {"ns", 16}, {"s", 17},
        {"vn", 18}, {"d", 19}, {"ad", 20}, {"an", 21}, {"j", 22}, {"b", 23},
        {"l", 24}, {"i", 25}, {"vd", 26}, {"z", 27}, {"Ng", 28}, {"Tg", 29},
        {"nz", 30}, {"y", 31}, {"nx", 32}, {"Ag", 33}, {"Dg", 34}, {"Bg", 35},
        {"h", 36}, {"Rg", 37}, {"vvn", 38}, {"o", 39}, {"Mg", 40}, {"e", 41},
        {"na", 42}, {"Yg", 43}
    };*/
    
    /*
     名词        n
                nr 人名
                ns 地名
                nt 机构团体
                nz 其它专名
     时间词      t
     处所词      s
     方位词      f
     动词        v
                vd 副动词
                vn 名动词
     形容词      a
                ad 副形词
                an 名形词
     区别词      b
     状态词      z
     代词       r
     数词       m
     量词       q
     副词       d
     介词       p
     连词       c
     助词       u
     叹词       e
     语气词      y
     拟声词      o
     简称略语    j
     习用语      l
     成语       i
     前接成分    h
     后接成分    k
     连接语    无
     语素字      g
                Ag 形语素
                Dg 副语素
                Ng 名语素
                Tg 时语素
                Vg 动语素
     非语素字    x
     标点符号    w
     */
    
    const map<int, string> HMMPOSTag :: id2pos =
    {
        {0, "v"}, {1, "n"}, {2, "u"}, {3, "a"}, {4, "w"}, {5, "t"},
        {6, "m"}, {7, "q"}, {8, "nt"}, {9, "nr"}, {10, "Vg"}, {11, "k"},
        {12, "p"}, {13, "f"}, {14, "r"}, {15, "c"}, {16, "ns"}, {17, "s"},
        {18, "vn"}, {19, "d"}, {20, "ad"}, {21, "an"}, {22, "j"}, {23, "b"},
        {24, "l"}, {25, "i"}, {26, "vd"}, {27, "z"}, {28, "Ng"}, {29, "Tg"},
        {30, "nz"}, {31, "y"}, {32, "nx"}, {33, "Ag"}, {34, "Dg"}, {35, "Bg"},
        {36, "h"}, {37, "Rg"}, {38, "vvn"}, {39, "o"}, {40, "Mg"}, {41, "e"},
        {42, "na"}, {43, "Yg"}
    };
    
}  // namespace dflas

